{
    "articles": [
        {
            "id": 1,
            "user": "Sample",
            "heading": "Conversational UI’s",
            "description": "More people than ever are using mobile messaging apps. It’s become the preferred means of communication with the total number of messages sent predicted to have taken over email by the summer of 2016. With consumers engaging with so many businesses online via chatbots to find or complete their purchases, it’s no wonder that we’re going to see a rise in what Chris Messina, the Developer Experience Lead at Uber calls ‘Conversational Commerce’. A great article.",
            "comments": [
                {
                    "user": "Tom",
                    "comment": "Why this?"
                },
                {
                    "user": "Jack",
                    "comment": "Why?"
                }
            ]
        },
        {
            "id": 2,
            "user": "Sample 2",
            "heading": "The Nine States Of Design",
            "description": "There’s the happy path and then there’s the unhappy path — and that’s the one arises when you interrogate your flow to find where user’s might stray-unintentionally or otherwise-from your idealised flow. This article by Vince Speelman breaks down the lifecycle of the states to look out for. And all too important if you’re designing for the checkout flow as it could be the difference between a completed or uncompleted purchase and with the latter, a frustrated customer.",
            "comments": [
                {
                    "user": "Tom",
                    "comment": "Why this?"
                },
                {
                    "user": "Jack",
                    "comment": "Why?"
                }
            ]
        },
        {
            "id": 3,
            "user": "Sample 3",
            "heading": "UI Design Starts With Words",
            "description": "To get my head into the system I’m designing (and probably like you if you work in UX) I begin with sketching out various user flows. Having just re-read this post by Luca Leone on Smashing Magazine I would have saved from couple of years ago, I’m going to try starting with words.",
            "comments": [
                {
                    "user": "Tom",
                    "comment": "Why this?"
                },
                {
                    "user": "Jack",
                    "comment": "Why?"
                }
            ]
        },
        {
            "id": 4,
            "user": "Sample 4",
            "heading": "Your UI Isn’t A Disney Movie",
            "description": "The overuse of animation in some UI can be prevalent. Sophie Paxton does a great job in her article setting down some guiding principles when animating for the web and how to avoid, as she calls it: ‘behavioural skeumorphism’",
            "comments": [
                {
                    "user": "Tom",
                    "comment": "Why this?"
                },
                {
                    "user": "Jack",
                    "comment": "Why?"
                }
            ]
        },
        {
            "id": 5,
            "user": "Sample 5",
            "heading": "Typography on User Interfaces",
            "description": "Setting type used to be a intricate process in the days when print media was the only way societies consumed information. We can put type to screen all too easily now. This article by Vilijalmi Salminen takes us back to the fundamentals and tells us how to set type for the web, what to look out for and where the future of Typography lies.",
            "comments": [
                {
                    "user": "Tom",
                    "comment": "Why this?"
                },
                {
                    "user": "Jack",
                    "comment": "Why?"
                }
            ]
        }
    ]
}